## Introduction to Pandas
### What's pandas?
 - Pandas is an open source library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language. <br>
 - Pandas is part of the Anaconda distribution and can be installed with Anaconda (e.g. <code> conda install pandas </code>) or via pip (<code> pip install pandas</code>) <br>
 - When working with tabular data, such as data stored in spreadsheets or databases, pandas is the right tool (assuming not so large files). <br>
pandas help us to explore, clean, and process our data. <br>
 - In pandas, a data table is called a DataFrame.  <br>
<img src="https://pandas.pydata.org/pandas-docs/stable/_images/01_table_dataframe.svg" width="600">

 - pandas supports the integration with many file formats or data sources out of the box (csv, excel, sql, json, parquet,â€¦). Importing data from each of these data sources is provided by function with the prefix <span style="color: red;">read_*</span>. Similarly, the <span style="color: red;">to_*</span> methods are used to store data <br> [e.g. <code> sales = pd.read_csv("sales_data.csv" </code>) ] <br>
<img src="https://pandas.pydata.org/pandas-docs/stable/_images/02_io_readwrite.svg" width="800">

Before working with different datasets, let's learn the basics.

<b> Note: </b> Make sure that you have/installed pandas and openpyxl before we proceed <br>.
Once again, you can use the terminal <br>
<code> conda install pandas </code> <br>
and <br>
<code> conda install -c anaconda openpyxl </code> 
<br>
If you don't use conda, then <br>
<code> pip install pandas  </code> <br>
<code> pip install openpyxl </code> 
<br>
<b> Note: </b> We will work on time series / date functionality later. <br>
In the meantime, you can start learning about them at <br>
https://pandas.pydata.org/docs/user_guide/timeseries.html <br>
https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases

In [1]:
import pandas as pd
import numpy as np

### Object Creation

In [2]:
# Creating a Series by passing a list of values, 
# letting pandas create a default integer index:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
# Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:
dates = pd.date_range('20190101', periods=6)

In [5]:
dates

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

Let's use dates as our index

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2019-01-01  1.103761 -1.917416  0.488894  1.273638
2019-01-02  2.497894 -0.478629 -0.565984  1.218096
2019-01-03  1.255214 -1.456333  1.014926  0.237944
2019-01-04 -1.832498 -1.050849 -0.018245  0.473519
2019-01-05 -0.557086  0.773183 -0.245014 -0.173704
2019-01-06  0.115841 -1.989157 -0.200159 -0.943184

In [8]:
# Creating a DataFrame by passing a dict of objects that can be converted to series-like.
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
# The columns of the resulting DataFrame have different dtypes.
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### Viewing Data

In [11]:
# Here is how to view the top rows of the frame:
df.head()

                   A         B         C         D
2019-01-01  1.103761 -1.917416  0.488894  1.273638
2019-01-02  2.497894 -0.478629 -0.565984  1.218096
2019-01-03  1.255214 -1.456333  1.014926  0.237944
2019-01-04 -1.832498 -1.050849 -0.018245  0.473519
2019-01-05 -0.557086  0.773183 -0.245014 -0.173704

In [12]:
# or
df.head(3)

                   A         B         C         D
2019-01-01  1.103761 -1.917416  0.488894  1.273638
2019-01-02  2.497894 -0.478629 -0.565984  1.218096
2019-01-03  1.255214 -1.456333  1.014926  0.237944

In [13]:
# Here is how to view the bottom rows of the frame:
df.tail(2)

                   A         B         C         D
2019-01-05 -0.557086  0.773183 -0.245014 -0.173704
2019-01-06  0.115841 -1.989157 -0.200159 -0.943184

In [14]:
# Display the index
df.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
# Display the columns
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
# DataFrame.values gives a NumPy representation of the underlying data
df.values

array([[ 1.10376107, -1.91741564,  0.4888942 ,  1.27363768],
       [ 2.4978942 , -0.47862921, -0.56598405,  1.21809602],
       [ 1.25521413, -1.45633329,  1.01492605,  0.23794412],
       [-1.83249846, -1.05084949, -0.01824498,  0.47351894],
       [-0.55708601,  0.77318286, -0.24501382, -0.17370369],
       [ 0.11584062, -1.98915748, -0.20015938, -0.94318402]])

In [17]:
# note that DataFrame.values does not include the index or column labels in the output.

In [18]:
# describe() shows a quick statistic summary of your data:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.430521 -1.019867  0.079070  0.347718
std    1.523355  1.043508  0.574865  0.846294
min   -1.832498 -1.989157 -0.565984 -0.943184
25%   -0.388854 -1.802145 -0.233800 -0.070792
50%    0.609801 -1.253591 -0.109202  0.355732
75%    1.217351 -0.621684  0.362109  1.031952
max    2.497894  0.773183  1.014926  1.273638

In [19]:
# Transposing your data:
df.T

   2019-01-01  2019-01-02  2019-01-03  2019-01-04  2019-01-05  2019-01-06
A    1.103761    2.497894    1.255214   -1.832498   -0.557086    0.115841
B   -1.917416   -0.478629   -1.456333   -1.050849    0.773183   -1.989157
C    0.488894   -0.565984    1.014926   -0.018245   -0.245014   -0.200159
D    1.273638    1.218096    0.237944    0.473519   -0.173704   -0.943184

In [20]:
# Sorting by an axis:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2019-01-01  1.273638  0.488894 -1.917416  1.103761
2019-01-02  1.218096 -0.565984 -0.478629  2.497894
2019-01-03  0.237944  1.014926 -1.456333  1.255214
2019-01-04  0.473519 -0.018245 -1.050849 -1.832498
2019-01-05 -0.173704 -0.245014  0.773183 -0.557086
2019-01-06 -0.943184 -0.200159 -1.989157  0.115841

In [21]:
# Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2019-01-06  0.115841 -1.989157 -0.200159 -0.943184
2019-01-01  1.103761 -1.917416  0.488894  1.273638
2019-01-03  1.255214 -1.456333  1.014926  0.237944
2019-01-04 -1.832498 -1.050849 -0.018245  0.473519
2019-01-02  2.497894 -0.478629 -0.565984  1.218096
2019-01-05 -0.557086  0.773183 -0.245014 -0.173704

### SELECTION

In [22]:
# Selecting a single column, which yields a Series, equivalent to df.A:
df['A']

2019-01-01    1.103761
2019-01-02    2.497894
2019-01-03    1.255214
2019-01-04   -1.832498
2019-01-05   -0.557086
2019-01-06    0.115841
Freq: D, Name: A, dtype: float64

In [23]:
df.A

2019-01-01    1.103761
2019-01-02    2.497894
2019-01-03    1.255214
2019-01-04   -1.832498
2019-01-05   -0.557086
2019-01-06    0.115841
Freq: D, Name: A, dtype: float64

In [24]:
# Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2019-01-01  1.103761 -1.917416  0.488894  1.273638
2019-01-02  2.497894 -0.478629 -0.565984  1.218096
2019-01-03  1.255214 -1.456333  1.014926  0.237944

In [25]:
df['20190102':'20190104']

                   A         B         C         D
2019-01-02  2.497894 -0.478629 -0.565984  1.218096
2019-01-03  1.255214 -1.456333  1.014926  0.237944
2019-01-04 -1.832498 -1.050849 -0.018245  0.473519

#### Selection by Label

In [26]:
# For getting a cross section using a label:
df.loc[dates[0]]

A    1.103761
B   -1.917416
C    0.488894
D    1.273638
Name: 2019-01-01 00:00:00, dtype: float64

In [27]:
# Selecting on a multi-axis by label:
df.loc[:, ['A', 'B']]

                   A         B
2019-01-01  1.103761 -1.917416
2019-01-02  2.497894 -0.478629
2019-01-03  1.255214 -1.456333
2019-01-04 -1.832498 -1.050849
2019-01-05 -0.557086  0.773183
2019-01-06  0.115841 -1.989157

In [28]:
# Showing label slicing, both endpoints are included:
df.loc['20190102':'20190104', ['A', 'B']]

                   A         B
2019-01-02  2.497894 -0.478629
2019-01-03  1.255214 -1.456333
2019-01-04 -1.832498 -1.050849

In [29]:
# Reduction in the dimensions of the returned object:
df.loc['20190102', ['A', 'B']]

A    2.497894
B   -0.478629
Name: 2019-01-02 00:00:00, dtype: float64

In [30]:
# For getting a scalar value:
df.loc[dates[0], 'A']

1.1037610661369883

In [31]:
# For getting fast access to a scalar (equivalent to the prior method):
df.at[dates[0], 'A']

1.1037610661369883

#### Selection by Position

In [32]:
# Select via the position of the passed integers:
df.iloc[3]

A   -1.832498
B   -1.050849
C   -0.018245
D    0.473519
Name: 2019-01-04 00:00:00, dtype: float64

In [33]:
# By integer slices, acting similar to numpy/python:
df.iloc[3:5, 0:2]

                   A         B
2019-01-04 -1.832498 -1.050849
2019-01-05 -0.557086  0.773183

In [34]:
# By lists of integer position locations, similar to the numpy/python style:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2019-01-02  2.497894 -0.565984
2019-01-03  1.255214  1.014926
2019-01-05 -0.557086 -0.245014

In [35]:
# For slicing rows explicitly:
df.iloc[1:3, :]

                   A         B         C         D
2019-01-02  2.497894 -0.478629 -0.565984  1.218096
2019-01-03  1.255214 -1.456333  1.014926  0.237944

In [36]:
# For slicing columns explicitly:
df.iloc[:, 1:3]

                   B         C
2019-01-01 -1.917416  0.488894
2019-01-02 -0.478629 -0.565984
2019-01-03 -1.456333  1.014926
2019-01-04 -1.050849 -0.018245
2019-01-05  0.773183 -0.245014
2019-01-06 -1.989157 -0.200159

In [37]:
# For getting a value explicitly:
df.iloc[1, 1]

-0.47862921272087844

In [38]:
# For getting fast access to a scalar (equivalent to the prior method):
df.iat[1, 1]

-0.47862921272087844

### Boolean Indexing

In [39]:
# Using a single columnâ€™s values to select data.
df[df.A > 0]

                   A         B         C         D
2019-01-01  1.103761 -1.917416  0.488894  1.273638
2019-01-02  2.497894 -0.478629 -0.565984  1.218096
2019-01-03  1.255214 -1.456333  1.014926  0.237944
2019-01-06  0.115841 -1.989157 -0.200159 -0.943184

In [40]:
# Selecting values from a DataFrame where a boolean condition is met
df[df > 0]

                   A         B         C         D
2019-01-01  1.103761       NaN  0.488894  1.273638
2019-01-02  2.497894       NaN       NaN  1.218096
2019-01-03  1.255214       NaN  1.014926  0.237944
2019-01-04       NaN       NaN       NaN  0.473519
2019-01-05       NaN  0.773183       NaN       NaN
2019-01-06  0.115841       NaN       NaN       NaN

In [41]:
# Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2019-01-01  1.103761 -1.917416  0.488894  1.273638    one
2019-01-02  2.497894 -0.478629 -0.565984  1.218096    one
2019-01-03  1.255214 -1.456333  1.014926  0.237944    two
2019-01-04 -1.832498 -1.050849 -0.018245  0.473519  three
2019-01-05 -0.557086  0.773183 -0.245014 -0.173704   four
2019-01-06  0.115841 -1.989157 -0.200159 -0.943184  three

In [42]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2019-01-03  1.255214 -1.456333  1.014926  0.237944   two
2019-01-05 -0.557086  0.773183 -0.245014 -0.173704  four

###  Setting

In [43]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20190102', periods=6))
s1

2019-01-02    1
2019-01-03    2
2019-01-04    3
2019-01-05    4
2019-01-06    5
2019-01-07    6
Freq: D, dtype: int64

In [44]:
df['F'] = s1

In [115]:
# note that our original index starts at the 1st day of the month
# however s1 starts at the 2nd day of the month
df

                    A           B          C           D
2000-01-01  -0.442150   -2.135448  -0.591369   -1.004904
2000-01-02  -0.774816   -2.184616  -1.284013   -0.888850
2000-01-03  -0.895905   -2.524869   0.825653   -0.179890
2000-01-04  -0.661406   -3.753354   3.039028   -2.002017
2000-01-05   0.211379   -3.944276   3.279754   -2.107158
...               ...         ...        ...         ...
2009-12-24 -80.968010 -118.857738 -96.457217 -104.689315
2009-12-25 -81.094116 -120.239313 -98.398297 -104.870969
2009-12-26 -82.979169 -119.768505 -96.451579 -103.002068
2009-12-27 -83.913927 -119.346361 -98.518743 -102.827600
2009-12-28 -84.183971 -119.357229 -99.415860 -102.032121

[3650 rows x 4 columns]

In [46]:
# Setting values by label:
df.at[dates[0], 'A'] = 0
# or df.iat[0, 1] = 0
df

                   A         B         C         D    F
2019-01-01  0.000000 -1.917416  0.488894  1.273638  NaN
2019-01-02  2.497894 -0.478629 -0.565984  1.218096  1.0
2019-01-03  1.255214 -1.456333  1.014926  0.237944  2.0
2019-01-04 -1.832498 -1.050849 -0.018245  0.473519  3.0
2019-01-05 -0.557086  0.773183 -0.245014 -0.173704  4.0
2019-01-06  0.115841 -1.989157 -0.200159 -0.943184  5.0

In [47]:
# Setting by assigning with a NumPy array:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2019-01-01  0.000000 -1.917416  0.488894  5  NaN
2019-01-02  2.497894 -0.478629 -0.565984  5  1.0
2019-01-03  1.255214 -1.456333  1.014926  5  2.0
2019-01-04 -1.832498 -1.050849 -0.018245  5  3.0
2019-01-05 -0.557086  0.773183 -0.245014  5  4.0
2019-01-06  0.115841 -1.989157 -0.200159  5  5.0

## MISSING DATA
pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations.

In [48]:
# Reindexing allows you to change/add/delete the index on a specified axis. 
# This returns a copy of the data.
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2019-01-01  0.000000 -1.917416  0.488894  5  NaN NaN
2019-01-02  2.497894 -0.478629 -0.565984  5  1.0 NaN
2019-01-03  1.255214 -1.456333  1.014926  5  2.0 NaN
2019-01-04 -1.832498 -1.050849 -0.018245  5  3.0 NaN

In [49]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2019-01-01  0.000000 -1.917416  0.488894  5  NaN  1.0
2019-01-02  2.497894 -0.478629 -0.565984  5  1.0  1.0
2019-01-03  1.255214 -1.456333  1.014926  5  2.0  NaN
2019-01-04 -1.832498 -1.050849 -0.018245  5  3.0  NaN

In [50]:
# To drop any rows that have missing data.
df1.dropna(how='any')

                   A         B         C  D    F    E
2019-01-02  2.497894 -0.478629 -0.565984  5  1.0  1.0

In [51]:
# Filling missing data.
df1.fillna(value=5)

                   A         B         C  D    F    E
2019-01-01  0.000000 -1.917416  0.488894  5  5.0  1.0
2019-01-02  2.497894 -0.478629 -0.565984  5  1.0  1.0
2019-01-03  1.255214 -1.456333  1.014926  5  2.0  5.0
2019-01-04 -1.832498 -1.050849 -0.018245  5  3.0  5.0

In [52]:
# To get the boolean mask where values are nan.
pd.isna(df1)

                A      B      C      D      F      E
2019-01-01  False  False  False  False   True  False
2019-01-02  False  False  False  False  False  False
2019-01-03  False  False  False  False  False   True
2019-01-04  False  False  False  False  False   True

## Operations

### Statistics

In [53]:
# Performing a descriptive statistic:
# average of columns
df.mean()

A    0.246561
B   -1.019867
C    0.079070
D    5.000000
F    3.000000
dtype: float64

In [54]:
# average of rows (simply by setting axis to 1)
df.mean(1)

2019-01-01    0.892870
2019-01-02    1.490656
2019-01-03    1.562761
2019-01-04    1.019681
2019-01-05    1.794217
2019-01-06    1.585305
Freq: D, dtype: float64

In [55]:
# Operating with objects that have different dimensionality and need alignment. 
# In addition, pandas automatically broadcasts along the specified dimension.
dates = pd.date_range('20190101', periods=6)
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2019-01-01    NaN
2019-01-02    NaN
2019-01-03    1.0
2019-01-04    3.0
2019-01-05    5.0
2019-01-06    NaN
Freq: D, dtype: float64

In [56]:
# Above, when we shift index, 1st month becomes 3 month, 2nd month becomes 4th, etc.
# but since we don't have 7th and 8th months in our index, when they are shifted,
# 1st and 2nd elements become NaN

In [57]:
# dataframe.sub: Subtraction of dataframe and other, element-wise (binary operator sub).
df.sub(s, axis='index')

                   A         B         C    D    F
2019-01-01       NaN       NaN       NaN  NaN  NaN
2019-01-02       NaN       NaN       NaN  NaN  NaN
2019-01-03  0.255214 -2.456333  0.014926  4.0  1.0
2019-01-04 -4.832498 -4.050849 -3.018245  2.0  0.0
2019-01-05 -5.557086 -4.226817 -5.245014  0.0 -1.0
2019-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

In [58]:
df

                   A         B         C  D    F
2019-01-01  0.000000 -1.917416  0.488894  5  NaN
2019-01-02  2.497894 -0.478629 -0.565984  5  1.0
2019-01-03  1.255214 -1.456333  1.014926  5  2.0
2019-01-04 -1.832498 -1.050849 -0.018245  5  3.0
2019-01-05 -0.557086  0.773183 -0.245014  5  4.0
2019-01-06  0.115841 -1.989157 -0.200159  5  5.0

In [59]:
# dataframe.cumsum returns cumulative sum over a DataFrame or Series axis.
#
# cumulative sum over columns
df.apply(np.cumsum)

                   A         B         C   D     F
2019-01-01  0.000000 -1.917416  0.488894   5   NaN
2019-01-02  2.497894 -2.396045 -0.077090  10   1.0
2019-01-03  3.753108 -3.852378  0.937836  15   3.0
2019-01-04  1.920610 -4.903228  0.919591  20   6.0
2019-01-05  1.363524 -4.130045  0.674577  25  10.0
2019-01-06  1.479364 -6.119202  0.474418  30  15.0

In [60]:
# finding range manually is also easy
df.apply(lambda x: x.max() - x.min())

A    4.330393
B    2.762340
C    1.580910
D    0.000000
F    4.000000
dtype: float64

## MERGING
pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

#### CONCAT

In [61]:
df = pd.DataFrame(np.random.randn(6, 6))
df

          0         1         2         3         4         5
0  1.157394  1.134585 -1.152600 -0.843783 -0.157722  0.745696
1  1.203213  0.496359 -2.167705  0.118344  0.514243 -0.018592
2 -0.145599 -0.334205 -1.642520 -0.046148 -0.048598 -0.188201
3  0.911614 -0.923217 -0.153263  1.533372  0.190634 -0.559474
4 -1.235399 -2.074842  0.246854 -0.200151  0.097416 -0.503555
5 -0.942867 -0.633983 -0.404423  0.371753  0.120950 -0.359726

In [62]:
# break it into pieces
pieces = [df[:2], df[4:6]]
pieces

[          0         1         2         3         4         5
 0  1.157394  1.134585 -1.152600 -0.843783 -0.157722  0.745696
 1  1.203213  0.496359 -2.167705  0.118344  0.514243 -0.018592,
           0         1         2         3         4         5
 4 -1.235399 -2.074842  0.246854 -0.200151  0.097416 -0.503555
 5 -0.942867 -0.633983 -0.404423  0.371753  0.120950 -0.359726]

In [63]:
pd.concat(pieces)

          0         1         2         3         4         5
0  1.157394  1.134585 -1.152600 -0.843783 -0.157722  0.745696
1  1.203213  0.496359 -2.167705  0.118344  0.514243 -0.018592
4 -1.235399 -2.074842  0.246854 -0.200151  0.097416 -0.503555
5 -0.942867 -0.633983 -0.404423  0.371753  0.120950 -0.359726

#### JOIN
SQL style merges

In [64]:
width = pd.DataFrame({'Model': ['Levis501', 'Levis550'], 'Width': [30, 32]})
width

      Model  Width
0  Levis501     30
1  Levis550     32

In [65]:
length = pd.DataFrame({'Model': ['Levis501', 'Levis550'], 'Length': [28, 34]})
length

      Model  Length
0  Levis501      28
1  Levis550      34

In [66]:
pd.merge(width, length, on='Model')

      Model  Width  Length
0  Levis501     30      28
1  Levis550     32      34

### APPEND

In [68]:
# Append rows to a dataframe
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.792653 -0.707900 -2.300423 -0.574571
1 -1.048441 -1.012457 -0.507079  1.350628
2  0.342399 -1.455259 -0.302403  0.738905
3  0.191240  1.671856 -0.521487  0.493502
4 -0.840968 -0.223983  2.387919  0.692257
5 -0.384381 -2.720600  1.242095 -0.565100
6 -0.294183  0.460387  0.652860 -1.713828
7  0.042110 -0.545682 -1.006446  0.666848

In [69]:
# Let's add 4th row to the end 
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.792653 -0.707900 -2.300423 -0.574571
1 -1.048441 -1.012457 -0.507079  1.350628
2  0.342399 -1.455259 -0.302403  0.738905
3  0.191240  1.671856 -0.521487  0.493502
4 -0.840968 -0.223983  2.387919  0.692257
5 -0.384381 -2.720600  1.242095 -0.565100
6 -0.294183  0.460387  0.652860 -1.713828
7  0.042110 -0.545682 -1.006446  0.666848
8  0.191240  1.671856 -0.521487  0.493502

## GROUPING

In [70]:
# By â€œgroup byâ€ we are referring to a process involving one or more of the following steps:
# (a) Splitting the data into groups based on some criteria
# (b) Applying a function to each group independently
# (c) Combining the results into a data structure

In [71]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.219195 -0.019970
1  bar    one  0.453341 -2.059058
2  foo    two -0.381324  0.802101
3  bar  three  0.143510 -0.655933
4  foo    two  0.624297 -0.170874
5  bar    two -0.132553  0.581925
6  foo    one  1.540323 -0.231079
7  foo  three  1.167929 -0.362614

In [72]:
# Grouping and then applying the sum() function to the resulting groups.
df.groupby('A').sum()

            C         D
A
bar  0.464299 -2.133066
foo  2.732030  0.017564

In [73]:
# Grouping by multiple columns forms a hierarchical index,
# and again we can apply the sum function.
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.453341 -2.059058
    three  0.143510 -0.655933
    two   -0.132553  0.581925
foo one    1.321128 -0.251049
    three  1.167929 -0.362614
    two    0.242972  0.631227

## Reshaping

In [74]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))
print(tuples)

[('bar', 'one'), ('bar', 'two'), ('baz', 'one'), ('baz', 'two'), ('foo', 'one'), ('foo', 'two'), ('qux', 'one'), ('qux', 'two')]

In [75]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -1.113269 -0.068776
      two     1.477455 -0.236609
baz   one     0.032848  1.090074
      two    -0.717777  0.142281
foo   one    -1.547704  0.133610
      two    -0.713054 -0.286330
qux   one    -1.594735 -0.964757
      two     0.699305 -1.216097

In [76]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -1.113269 -0.068776
      two     1.477455 -0.236609
baz   one     0.032848  1.090074
      two    -0.717777  0.142281

#### STACK

In [77]:
# The stack() method â€œcompressesâ€ a level in the DataFrameâ€™s columns.
stacked = df2.stack()
stacked

first  second
bar    one     A   -1.113269
               B   -0.068776
       two     A    1.477455
               B   -0.236609
baz    one     A    0.032848
               B    1.090074
       two     A   -0.717777
               B    0.142281
dtype: float64

In [78]:
# With a â€œstackedâ€ DataFrame or Series (having a MultiIndex as the index), 
# the inverse operation of stack() is unstack(), which by default unstacks the last level:
stacked.unstack()

                     A         B
first second
bar   one    -1.113269 -0.068776
      two     1.477455 -0.236609
baz   one     0.032848  1.090074
      two    -0.717777  0.142281

In [79]:
stacked.unstack(1)

second        one       two
first
bar   A -1.113269  1.477455
      B -0.068776 -0.236609
baz   A  0.032848 -0.717777
      B  1.090074  0.142281

In [80]:
# Remember df2
df2

                     A         B
first second
bar   one    -1.113269 -0.068776
      two     1.477455 -0.236609
baz   one     0.032848  1.090074
      two    -0.717777  0.142281

In [81]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.113269  0.032848
       B -0.068776  1.090074
two    A  1.477455 -0.717777
       B -0.236609  0.142281

### PIVOT TABLES

In [82]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  1.760605  0.254174
1     one  B  foo -0.411400  0.464432
2     two  C  foo -0.153910  0.866336
3   three  A  bar -0.521082 -0.036613
4     one  B  bar -0.198266  0.085389
5     one  C  bar -1.149835 -1.123252
6     two  A  foo -0.887690 -0.585031
7   three  B  foo  0.004679  0.002484
8     one  C  foo  0.317806  0.672639
9     one  A  bar -0.066600  0.583792
10    two  B  bar -1.962035 -0.147992
11  three  C  bar -1.248121 -0.870312

In [83]:
# We can produce pivot tables from this data very easily:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.066600  1.760605
      B -0.198266 -0.411400
      C -1.149835  0.317806
three A -0.521082       NaN
      B       NaN  0.004679
      C -1.248121       NaN
two   A       NaN -0.887690
      B -1.962035       NaN
      C       NaN -0.153910

In [84]:
# Example 2
df = pd.DataFrame({
    'A': ['A','B','AB','0']*3,
    'B': np.random.randn(12),
    'C': ['Male','Male','Male','Female','Female','Female']*2,
    'D': np.random.randint(1940,2001,12)})  
df['B'] = df['B'].apply(lambda x: 1 if np.random.randn() > 0 else -1)

In [85]:
df

     A  B       C     D
0    A -1    Male  1941
1    B  1    Male  1980
2   AB -1    Male  1970
3    0  1  Female  1982
4    A  1  Female  1947
5    B -1  Female  1992
6   AB -1    Male  1995
7    0  1    Male  1962
8    A  1    Male  1962
9    B  1  Female  1949
10  AB -1  Female  1983
11   0  1  Female  1945

In [86]:
pd.pivot_table(df,values='D',index=['A','B'], columns=['C'])

C      Female    Male
A  B
0   1  1963.5  1962.0
A  -1     NaN  1941.0
    1  1947.0  1962.0
AB -1  1983.0  1982.5
B  -1  1992.0     NaN
    1  1949.0  1980.0

## GETTING DATA IN/OUT

### CSV

In [110]:
# Writing to a csv file
df.to_csv('foo.csv')

In [111]:
# Reading from a csv file.
pd.read_csv('foo.csv')

      Unnamed: 0          A           B          C           D
0     2000-01-01  -0.442150   -2.135448  -0.591369   -1.004904
1     2000-01-02  -0.774816   -2.184616  -1.284013   -0.888850
2     2000-01-03  -0.895905   -2.524869   0.825653   -0.179890
3     2000-01-04  -0.661406   -3.753354   3.039028   -2.002017
4     2000-01-05   0.211379   -3.944276   3.279754   -2.107158
...          ...        ...         ...        ...         ...
3645  2009-12-24 -80.968010 -118.857738 -96.457217 -104.689315
3646  2009-12-25 -81.094116 -120.239313 -98.398297 -104.870969
3647  2009-12-26 -82.979169 -119.768505 -96.451579 -103.002068
3648  2009-12-27 -83.913927 -119.346361 -98.518743 -102.827600
3649  2009-12-28 -84.183971 -119.357229 -99.415860 -102.032121

[3650 rows x 5 columns]

### Excel

In [112]:
# Writing to an excel file.
df.to_excel('foo.xlsx', sheet_name='Sheet1')

In [113]:
# Reading from an excel file.
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

     Unnamed: 0          A           B          C           D
0    2000-01-01  -0.442150   -2.135448  -0.591369   -1.004904
1    2000-01-02  -0.774816   -2.184616  -1.284013   -0.888850
2    2000-01-03  -0.895905   -2.524869   0.825653   -0.179890
3    2000-01-04  -0.661406   -3.753354   3.039028   -2.002017
4    2000-01-05   0.211379   -3.944276   3.279754   -2.107158
...         ...        ...         ...        ...         ...
3645 2009-12-24 -80.968010 -118.857738 -96.457217 -104.689315
3646 2009-12-25 -81.094116 -120.239313 -98.398297 -104.870969
3647 2009-12-26 -82.979169 -119.768505 -96.451579 -103.002068
3648 2009-12-27 -83.913927 -119.346361 -98.518743 -102.827600
3649 2009-12-28 -84.183971 -119.357229 -99.415860 -102.032121

[3650 rows x 5 columns]